# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2024-06-19 19:08:05 krylon>
#
#+TAGS: optimize(o) refactor(r) bug(b) feature(f) architecture(a)
#+TAGS: web(w) database(d) javascript(j)
#+TODO: TODO(t) IMPLEMENT(i) TEST(e) RESEARCH(r) | DONE(d)
#+TODO: MEDITATE(m) PLANNING(p) REFINE(n) | FAILED(f) CANCELLED(c) SUSPENDED(s)
#+TODO: EXPERIMENT(x) |
#+PRIORITIES: A G D

* Donkey
  A simple-minded network monitoring application
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 20
   #+CAPTION: Clock summary at [2024-06-19 Mi 19:08]
   | Headline                           | Time      |         |       |      |
   |------------------------------------+-----------+---------+-------+------|
   | *Total time*                       | *1d 9:53* |         |       |      |
   |------------------------------------+-----------+---------+-------+------|
   | Donkey                             | 1d 9:53   |         |       |      |
   | \_  Components [0/1]               |           | 1d 9:53 |       |      |
   | \_    Database [0/1]               |           |         |  6:20 |      |
   | \_      JSON without the Argonauts |           |         |       | 0:30 |
   | \_    Server [0/0]                 |           |         | 11:31 |      |
   | \_      Webservice [0/0]           |           |         |       | 5:22 |
   | \_    Agent [0/1]                  |           |         | 16:02 |      |
   | \_      Configuration              |           |         |       | 1:27 |
   #+END:
** Diary
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Database [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-06-15 Sa 16:17]--[2024-06-15 Sa 17:22] =>  1:05
    CLOCK: [2024-06-07 Fr 18:36]--[2024-06-07 Fr 20:42] =>  2:06
    CLOCK: [2024-06-07 Fr 18:20]--[2024-06-07 Fr 18:29] =>  0:09
    CLOCK: [2024-06-07 Fr 17:49]--[2024-06-07 Fr 18:09] =>  0:20
    CLOCK: [2024-06-06 Do 18:39]--[2024-06-06 Do 20:49] =>  2:10
    :END:
    I need to find a way to handle differently structured kinds of data from
    measurements, such system load avg, temperature data from sensors, etc.
    I would like to use this opportunity to explore SQLite's JSON support.
    So I really should need only a single table to store those records, a TEXT
    field for the JSON payload, some metadata...
**** TODO JSON without the Argonauts
     :LOGBOOK:
     CLOCK: [2024-06-17 Mo 22:13]--[2024-06-17 Mo 22:43] =>  0:30
     :END:
*** Server [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-06-10 Mo 22:23]--[2024-06-10 Mo 23:39] =>  1:16
    CLOCK: [2024-06-10 Mo 18:48]--[2024-06-10 Mo 21:31] =>  2:43
    CLOCK: [2024-06-09 So 16:37]--[2024-06-09 So 18:38] =>  2:01
    CLOCK: [2024-06-09 So 16:20]--[2024-06-09 So 16:29] =>  0:09
    :END:
**** Webservice [0/0]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: children
     :END:
     :LOGBOOK:
     CLOCK: [2024-06-19 Mi 18:50]--[2024-06-19 Mi 19:08] =>  0:18
     CLOCK: [2024-06-18 Di 14:25]--[2024-06-18 Di 15:32] =>  1:07
     CLOCK: [2024-06-17 Mo 20:59]--[2024-06-17 Mo 21:49] =>  0:50
     CLOCK: [2024-06-11 Di 17:36]--[2024-06-11 Di 18:31] =>  0:55
     CLOCK: [2024-06-11 Di 14:15]--[2024-06-11 Di 15:35] =>  1:20
     CLOCK: [2024-06-11 Di 10:55]--[2024-06-11 Di 11:47] =>  0:52
     :END:
     I should probably think about the "language" the Agent and Server speak
     to each other.
*** Agent [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-06-17 Mo 19:30]--[2024-06-17 Mo 19:30] =>  0:00
    CLOCK: [2024-06-17 Mo 18:15]--[2024-06-17 Mo 19:03] =>  0:48
    CLOCK: [2024-06-15 Sa 17:22]--[2024-06-15 Sa 19:05] =>  1:43
    CLOCK: [2024-06-15 Sa 15:39]--[2024-06-15 Sa 16:17] =>  0:38
    CLOCK: [2024-06-14 Fr 21:10]--[2024-06-14 Fr 23:33] =>  2:23
    CLOCK: [2024-06-13 Do 17:57]--[2024-06-13 Do 18:25] =>  0:28
    CLOCK: [2024-06-12 Mi 17:58]--[2024-06-12 Mi 21:50] =>  3:52
    CLOCK: [2024-06-11 Di 19:46]--[2024-06-11 Di 23:19] =>  3:33
    CLOCK: [2024-06-11 Di 18:31]--[2024-06-11 Di 19:41] =>  1:10
    :END:
**** TODO Configuration
     :LOGBOOK:
     CLOCK: [2024-06-17 Mo 19:51]--[2024-06-17 Mo 20:59] =>  1:08
     CLOCK: [2024-06-17 Mo 19:30]--[2024-06-17 Mo 19:49] =>  0:19
     :END:
     I want to be able to configure at runtime which Probes I run, at which
     intervals, etc.
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
